/**
 * 青蛙一次可以跳上一级台阶，也可以跳上2级台阶，求该青蛙跳上n级台阶共有多少种跳法
 * @param {青蛙跳n级台阶} n 
 */
function frogJump1(n) {
// f(1) = 1;
// f(2) = 2; 
// f(n) = f(n-1) + f(n-2), n=3, 4, 5....
}

/**
 * 青蛙一次可以跳上一级台阶，也可以跳上2级台阶....也可以跳n级台阶，
 * 求该青蛙跳上n级台阶共有多少种跳法
 * @param {青蛙跳n级台阶} n 
 */
function frogJump2(n) {
    // f(0) = 1;
    // f(1) = 1;
    // f(2) = 2; 
    // f(n) = f(n-1) + f(n-2) + ... + f(0), n=3, 4, 5....
    //  -----> 2^n
}

/**
 * 用8个2*1的小矩形无重叠的覆盖一个2*8的大矩形，共有多少种方法
 */

 function rectCover() {
    //  斐波那契数列
 }